[
  {
    "title": "Online Zoom Workshop",
    "colour": "#751CCE",
    "date": "Fri 21 Aug 2020",
    "before-link": "Nullam justo arcu, tate sodales. Nunc eu maximus erat. Integer ornare ante velit. Donec sed placerat orci. ",
    "link": "https://zoom.us/126786973404123874",
    "after-link": "et mollis nisl. Mauris pharetra dui et mauris tristique consectetur. Nulla ut aliquam tellus. Sed pretium tristique tristique. Pellentesque mollis non metus vitae auctor. Donec tempor pulvinar luctus. Phasellus pharetra quis velit ut placerat."
  },
  {
    "title": "Lecture 8am Friday",
    "link": "https://zoom.us/1-4930284u214jl3k2",
    "colour": "#751CCE",
    "date": "Thu 20 Aug 2020",
    "before-link": "Interdum et malesuada fames ac ante ipsum primis in faucibus. In a urna in ligula dictum consectetur in non justo. Ut suscipit libero et euismod eleifend. Ut a feugiat magna, a gravida sem. Proin aliquet sollicitudin ante ",
    "after-link": "quis placerat aliquam. Aliquam ultricies, justo et rutrum condimentum, nunc turpis mollis sem, ac tempus tortor ligula non odio.."
  },
  {
    "title": "Tutorial Zoom Link",
    "link": "https:/blackboard/o84poweuqiljkfds",
    "colour": "#FF5A5F",
    "date": "Wed 19 Aug 2020",
    "before-link": " Aliquam ac diam scelerisque, lacinia neque eget, ullamcorper arcu. Etiam viverra quis nisl ",
    "after-link": " at consectetur. Cras sed risus dolor. Nam commodo, ante ac dignissim laoreet, velit leo mattis nulla, eget hendrerit quam eros ut enim. Etiam gravida urna magna, vel volutpat enim sollicitudin a. Curabitur convallis feugiat eros non finibus. Ut scelerisque sem est, eu pulvinar odio sagittis eget. Sed urna arcu, bibendum eget leo eget, maximus ultrices tortor. Aenean blandit ex placerat, porttitor metus vel, semper tellus. Etiam lectus lorem, tempus non purus sit amet, cursus laoreet nulla. Nam eget tempus enim."
  },
  {
    "title": "Week 3 Workshop Instructions",
    "link": null,
    "colour": "#DBAD6A",
    "date": "Wed 19 Aug 2020",
    "before-link": "Morbi augue ligula, posuere eu fringilla eget, aliquet id dolor. Cras dictum porta metus vel pellentesque. Cras tortor risus, semper sed augue ut, varius pellentesque turpis. Proin sit amet fringilla velit, et euismod lectus. In sollicitudin magna vehicula quam tempor, nec commodo justo lacinia. Donec pretium dictum eros in commodo. Mauris tincidunt dignissim ligula ac cursus. Mauris pulvinar mi non nibh accumsan, ut auctor purus mollis."
  },
  {
    "title": "this sentence is 50 char long hahahahahaha 123456 45465495465456",
    "link": null,
    "colour": "#FF5A5F",
    "date": "Wed 19 Aug 2020",
    "before-link": "Mauris rutrum dui in urna elementum, eu tempus erat rhoncus. Cras facilisis, lectus id gravida luctus, eros odio scelerisque justo, ut hendrerit ante lorem eget enim. Nunc facilisis ullamcorper vehicula. Vivamus commodo semper diam, non facilisis urna hendrerit et. Maecenas sit amet dui erat. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae; Sed sollicitudin a erat in varius."
  },
  {
    "title": "Team Meetings",
    "link": null,
    "colour": "#A0B798",
    "date": "Saturday 15 Aug 2020",
    "before-link": "Curabitur in laoreet odio, ac aliquam arcu. In at orci eu augue malesuada vestibulum nec nec ante. Morbi mattis nulla sed augue pellentesque volutpat. Ut a lacus lorem. Fusce sapien felis, consectetur et finibus sit amet, tempus eu sapien. Vivamus id neque id augue bibendum efficitur. Ut lacinia dui ultricies leo lacinia, ut malesuada neque venenatis. Pellentesque fringilla euismod nisi, vitae tincidunt lacus efficitur quis. Donec mattis pellentesque enim, vitae euismod massa ornare euismod. Aliquam dignissim velit sodales tellus tincidunt, sed posuere neque vehicula. Sed vitae euismod odio. Nunc lectus dui, congue eu ex et, commodo facilisis purus. Nam non molestie magna, at suscipit mi. Cras auctor laoreet tortor, ut convallis nibh porttitor id. Duis risus sapien, semper sit amet euismod ac, interdum eget lectus."
  },
  {
    "title": "Sleeping in Lectures",
    "link": null,
    "colour": "#087E8B",
    "date": "Saturday 15 Aug 2020",
    "before-link": "Integer quis tortor bibendum, hendrerit massa sit amet, ultricies dui. Interdum et malesuada fames ac ante ipsum primis in faucibus. Fusce varius enim neque, at efficitur quam porta eu. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Aliquam nec luctus nibh. Nulla quis euismod metus. Donec vel purus at mi dapibus bibendum. Integer semper erat nec erat malesuada, sit amet consectetur nunc pretium. Mauris ac ante neque. Quisque eget cursus dui. Donec feugiat rhoncus tincidunt. Integer tincidunt justo ac est porta sagittis. Morbi imperdiet, mauris in sodales tristique, ante lacus imperdiet nunc, a malesuada nisl augue quis diam. Praesent porta lacinia mi et iaculis. Pellentesque at venenatis ipsum.."
  },
  {
    "title": "Sleeping in Lectures 2",
    "link": null,
    "colour": "#FF5A5F",
    "date": "Saturday 15 Aug 2020",
    "before-link": "Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Morbi vestibulum, ligula id scelerisque feugiat, purus dolor condimentum dolor, quis interdum ante neque id nulla. Etiam nec maximus risus. Donec eleifend, purus sed vulputate molestie, massa augue blandit purus, vel lobortis augue lorem eu nisi. Sed tempus turpis nec ultrices tempor. Cras non libero gravida, mollis ipsum quis, lacinia dui. Quisque in vestibulum nunc. In maximus, ex at cursus semper, lectus sem rutrum purus, porttitor faucibus nibh odio sed quam. Proin vitae auctor sem. Phasellus non erat libero. Integer posuere, nulla in finibus dignissim, leo neque dictum diam, eget maximus purus libero eu diam. Proin ac ex porttitor, sollicitudin augue a, suscipit dolor. Etiam eget erat id leo volutpat tincidunt. Duis congue massa vitae ultricies pulvinar. Cras gravida, nulla at lobortis tempor, metus arcu varius diam, ac aliquam sapien dui in quam. Nam fermentum pellentesque sapien non tempus."
  },
  {
    "title": "Online Zoom Workshop",
    "link": null,
    "colour": "#751CCE",
    "date": "Fri 21 Aug 2020",
    "before-link": "Nullam justo arcu, interdum ut feugiat in, sagittis sed dui. Nulla tincidunt fringilla ipsum, sed dictum est varius nec. Suspendisse enim eros, efficitur convallis faucibus at, commodo at erat. Duis euismod non erat sit amet molestie. Curabitur vulputate vulputate sodales. Nunc eu maximus erat. Integer ornare ante velit. Donec sed placerat orci. et mollis nisl. Mauris pharetra dui et mauris tristique consectetur. Nulla ut aliquam tellus. Sed pretium tristique tristique. Pellentesque mollis non metus vitae auctor. Donec tempor pulvinar luctus. Phasellus pharetra quis velit ut placerat."
  },
  {
    "title": "Lecture 8am Friday",
    "link": null,
    "colour": "#751CCE",
    "date": "Thu 20 Aug 2020",
    "before-link": "Interdum et malesuada fames ac ante ipsum primis in faucibus. In a urna in ligula dictum consectetur in non justo. Ut suscipit libero et euismod eleifend. Ut a feugiat magna, a gravida sem. Proin aliquet sollicitudin ante, vel semper justo. Curabitur orci diam, elementum sed ante ac, pharetra elementum felis. Ut tincidunt risus quis placerat aliquam. Aliquam ultricies, justo et rutrum condimentum, nunc turpis mollis sem, ac tempus tortor ligula non odio.."
  },
  {
    "title": "Tutorial Zoom Link",
    "link": null,
    "colour": "#FF5A5F",
    "date": "Wed 19 Aug 2020",
    "before-link": " Aliquam ac diam scelerisque, lacinia neque eget, ullamcorper arcu. Etiam viverra quis nisl at consectetur. Cras sed risus dolor. Nam commodo, ante ac dignissim laoreet, velit leo mattis nulla, eget hendrerit quam eros ut enim. Etiam gravida urna magna, vel volutpat enim sollicitudin a. Curabitur convallis feugiat eros non finibus. Ut scelerisque sem est, eu pulvinar odio sagittis eget. Sed urna arcu, bibendum eget leo eget, maximus ultrices tortor. Aenean blandit ex placerat, porttitor metus vel, semper tellus. Etiam lectus lorem, tempus non purus sit amet, cursus laoreet nulla. Nam eget tempus enim."
  },
  {
    "title": "Week 5 Workshop Instructions",
    "link": null,
    "colour": "#751CCE",
    "date": "Wed 19 Aug 2020",
    "before-link": "Morbi augue ligula, posuere eu fringilla eget, aliquet id dolor. Cras dictum porta metus vel pellentesque. Cras tortor risus, semper sed augue ut,varius pellentesque turpis. Proin sit amet fringilla velit, et euismod lectus. In sollicitudin magna vehicula quam tempor, nec commodo justo lacinia. Donec pretium dictum eros in commodo. Mauris tincidunt dignissim ligula ac cursus. Mauris pulvinar mi non nibh accumsan, ut auctor purus mollis."
  },
  {
    "title": "Assignment 2 is released",
    "link": null,
    "colour": "#FF5A5F",
    "date": "Wed 29 Aug 2020",
    "before-link": "Mauris rutrum dui in urna elementum, eu tempus erat rhoncus. Cras facilisis, lectus id gravida luctus, eros odio scelerisque justo, ut hendrerit ante lorem eget enim. Nunc facilisis ullamcorper vehicula. Vivamus commodo semper diam, non facilisis urna hendrerit et. Maecenas sit amet dui erat. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae; Sed sollicitudin a erat in varius."
  },
  {
    "title": "Zoom Session",
    "link": null,
    "colour": "#087E8B",
    "date": "Monday 37 Aug 2029",
    "before-link": "Suspendisse arcu nulla, venenatis a nisl vitae, finibus suscipit dui. Fusce consectetur condimentum elit blandit sodales. Sed eget massa ut dui ultrices aliquam. Proin libero erat, faucibus ac dolor molestie, tempus fermentum felis. Aliquam et eros quis ligula consequat efficitur eu vel nibh. Mauris eu ex ultrices, aliquam metus id, lobortis metus.."
  },
  {
    "title": "Team Meetings 7",
    "link": null,
    "colour": "#A0B798",
    "date": "Saturday 15 Aug 2020",
    "before-link": "Curabitur in laoreet odio, ac aliquam arcu. In at orci eu augue malesuada vestibulum nec nec ante. Morbi mattis nulla sed augue pellentesque volutpat. Ut a lacus lorem. Fusce sapien felis, consectetur et finibus sit amet, tempus eu sapien. Vivamus id neque id augue bibendum efficitur. Ut lacinia dui ultricies leo lacinia, ut malesuada neque venenatis. Pellentesque fringilla euismod nisi, vitae tincidunt lacus efficitur quis. Donec mattis pellentesque enim, vitae euismod massa ornare euismod. Aliquam dignissim velit sodales tellus tincidunt, sed posuere neque vehicula. Sed vitae euismod odio. Nunc lectus dui, congue eu ex et, commodo facilisis purus. Nam non molestie magna, at suscipit mi. Cras auctor laoreet tortor, ut convallis nibh porttitor id. Duis risus sapien, semper sit amet euismod ac, interdum eget lectus."
  },
  {
    "title": "Sleeping in Lectures 69",
    "link": null,
    "colour": "#087E8B",
    "date": "Saturday 15 Aug 2020",
    "before-link": "Integer quis tortor bibendum, hendrerit massa sit amet, ultricies dui. Interdum et malesuada fames ac ante ipsum primis in faucibus. Fusce varius enim neque, at efficitur quam porta eu. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Aliquam nec luctus nibh. Nulla quis euismod metus. Donec vel purus at mi dapibus bibendum. Integer semper erat nec erat malesuada, sit amet consectetur nunc pretium. Mauris ac ante neque. Quisque eget cursus dui. Donec feugiat rhoncus tincidunt. Integer tincidunt justo ac est porta sagittis. Morbi imperdiet, mauris in sodales tristique, ante lacus imperdiet nunc, a malesuada nisl augue quis diam. Praesent porta lacinia mi et iaculis. Pellentesque at venenatis ipsum.."
  },
  {
    "title": "Sleeping in Lectures 420",
    "link": null,
    "colour": "#001564",
    "date": "Saturday 15 Aug 2020",
    "before-link": "Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Morbi vestibulum, ligula id scelerisque feugiat, purus dolor condimentum dolor, quis interdum ante neque id nulla. Etiam nec maximus risus. Donec eleifend, purus sed vulputate molestie, massa augue blandit purus, vel lobortis augue lorem eu nisi. Sed tempus turpis nec ultrices tempor. Cras non libero gravida, mollis ipsum quis, lacinia dui. Quisque in vestibulum nunc. In maximus, ex at cursus semper, lectus sem rutrum purus, porttitor faucibus nibh odio sed quam. Proin vitae auctor sem. Phasellus non erat libero. Integer posuere, nulla in finibus dignissim, leo neque dictum diam, eget maximus purus libero eu diam. Proin ac ex porttitor, sollicitudin augue a, suscipit dolor. Etiam eget erat id leo volutpat tincidunt. Duis congue massa vitae ultricies pulvinar. Cras gravida, nulla at lobortis tempor, metus arcu varius diam, ac aliquam sapien dui in quam. Nam fermentum pellentesque sapien non tempus."
  }
]
